src/Reports/ПланИФактПоступлений/ПланИФактПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПланИФактПоступлений</name>
</mdclass:Report>

src/AccumulationRegisters/ПлатежиПоДоговорам/ПлатежиПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПлатежиПоДоговорам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыАрендаторов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Арендаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/ДоговорыАрендаторов/ДоговорыАрендаторов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыАрендаторов</name>
  <owners>Catalog.Арендаторы</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автопродление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаАрендыЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечительныйПлатеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЗаКвМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Площадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПлатежей</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ПланИФактПоступлений/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокАрендаторов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Арендаторы");
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецГода(ТекущаяДатаСеанса());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ВывестиСообщение("Заполните начало и окончание периода отчёта");
		Возврат;
	КонецЕсли;
	
	Если НачалоМесяца(ДатаНачала) > НачалоМесяца(ДатаОкончания) Тогда
		ВывестиСообщение("Начало периода позже его окончания");
		Возврат;
	КонецЕсли;
	
	Таблица = СформироватьТаблицу(ДатаНачала, ДатаОкончания, СписокАрендаторов);
	Месяцы = СписокМесяцевСДанными(Таблица, ДатаНачала, ДатаОкончания);
	Если Месяцы.Количество() = 0 Тогда
		Результат.Очистить();
		ВывестиСообщение("За выбранный период данные отсутствуют");
		Возврат;
	КонецЕсли;
	
	ДолгиНаНачало = СформироватьДолгиНаНачалоПериода(ДатаНачала, СписокАрендаторов);
	
	ВывестиРезультат(Таблица, Месяцы, ДолгиНаНачало);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРезультат(Таблица, Месяцы, ДолгиНаНачало)
	
	Результат.Очистить();
	
	Данные = Новый Соответствие;
	АрендаторыДоговоров = Новый Соответствие;
	ПорядокДоговоров = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Договор = СтрокаТаблицы.Договор;
		СтрокиДоговора = Данные[Договор];
		Если СтрокиДоговора = Неопределено Тогда
			СтрокиДоговора = Новый Соответствие;
			Данные.Вставить(Договор, СтрокиДоговора);
			АрендаторыДоговоров.Вставить(Договор, СтрокаТаблицы.Арендатор);
			ПорядокДоговоров.Добавить(Договор);
		КонецЕсли;
		
		Значения = Новый Структура("План, Факт", СтрокаТаблицы.План, СтрокаТаблицы.Факт);
		СтрокиДоговора.Вставить(СтрокаТаблицы.Период, Значения);
		
	КонецЦикла;
	
	МаксимальнаяКолонка = 4 + Месяцы.Количество() * 3;
	
	ОбластьАрендатор = Результат.Область(1, 1, 2, 1);
	ОбластьАрендатор.Объединить();
	ОбластьАрендатор.Текст = "Арендатор";
	
	ОбластьДоговор = Результат.Область(1, 2, 2, 2);
	ОбластьДоговор.Объединить();
	ОбластьДоговор.Текст = "Договор";
	
	ОбластьДолгНачало = Результат.Область(1, 3, 2, 3);
	ОбластьДолгНачало.Объединить();
	ОбластьДолгНачало.Текст = "Долг на начало периода";
	
	ОбластьДолгКонец = Результат.Область(1, 4, 2, 4);
	ОбластьДолгКонец.Объединить();
	ОбластьДолгКонец.Текст = "Долг на конец периода";
	
	Колонка = 5;
	Для Каждого Месяц Из Месяцы Цикл
		ЗаголовокМесяца = Формат(Месяц, "ДФ='ММММ гггг'");
		
		ОбластьПериода = Результат.Область(1, Колонка, 1, Колонка + 2);
		ОбластьПериода.Объединить();
		ОбластьПериода.Текст = ЗаголовокМесяца;
		
		Результат.Область(2, Колонка, 2, Колонка).Текст = "План";
		Результат.Область(2, Колонка + 1, 2, Колонка + 1).Текст = "Факт";
		Результат.Область(2, Колонка + 2, 2, Колонка + 2).Текст = "Долг";
		
		Колонка = Колонка + 3;
	КонецЦикла;
	
	ИтогоДолгНачало = 0;
	ИтогоДолгКонец = 0;
	
	НомерСтроки = 2;
	Для Каждого Договор Из ПорядокДоговоров Цикл
		
		НомерСтроки = НомерСтроки + 1;
		Результат.Область(НомерСтроки, 1, НомерСтроки, 1).Текст = Строка(АрендаторыДоговоров[Договор]);
		Результат.Область(НомерСтроки, 2, НомерСтроки, 2).Текст = Строка(Договор);
		
		СтрокиДоговора = Данные[Договор];
		НакопительныйДолг = ДолгиНаНачало[Договор];
		Если НакопительныйДолг = Неопределено Тогда
			НакопительныйДолг = 0;
		КонецЕсли;
		ИтогоДолгНачало = ИтогоДолгНачало + НакопительныйДолг;
		
		Результат.Область(НомерСтроки, 3, НомерСтроки, 3).Текст = Формат(НакопительныйДолг, "ЧДЦ=2");
		
		Колонка = 5;
		Для Каждого Месяц Из Месяцы Цикл
			
			Значения = СтрокиДоговора[Месяц];
			Если Значения <> Неопределено Тогда
				Результат.Область(НомерСтроки, Колонка, НомерСтроки, Колонка).Текст = Формат(Значения.План, "ЧДЦ=2");
				Результат.Область(НомерСтроки, Колонка + 1, НомерСтроки, Колонка + 1).Текст = Формат(Значения.Факт, "ЧДЦ=2");
				НакопительныйДолг = НакопительныйДолг + Значения.План - Значения.Факт;
			КонецЕсли;
			
			Результат.Область(НомерСтроки, Колонка + 2, НомерСтроки, Колонка + 2).Текст = Формат(НакопительныйДолг, "ЧДЦ=2");
			
			Колонка = Колонка + 3;
			
		КонецЦикла;
		
		Результат.Область(НомерСтроки, 4, НомерСтроки, 4).Текст = Формат(НакопительныйДолг, "ЧДЦ=2");
		ИтогоДолгКонец = ИтогоДолгКонец + НакопительныйДолг;
		
	КонецЦикла;
	
	НомерСтроки = НомерСтроки + 1;
	Результат.Область(НомерСтроки, 1, НомерСтроки, 1).Текст = "Итого";
	Результат.Область(НомерСтроки, 3, НомерСтроки, 3).Текст = Формат(ИтогоДолгНачало, "ЧДЦ=2");
	Результат.Область(НомерСтроки, 4, НомерСтроки, 4).Текст = Формат(ИтогоДолгКонец, "ЧДЦ=2");
	
	Результат.Область(1, 1, 1, 1).ШиринаКолонки = 23;
	Результат.Область(1, 2, 1, 2).ШиринаКолонки = 23;
	Результат.Область(1, 3, 1, 3).ШиринаКолонки = 12;
	Результат.Область(1, 4, 1, 4).ШиринаКолонки = 12;
	Для Колонка = 5 По МаксимальнаяКолонка Цикл
		Результат.Область(1, Колонка, 1, Колонка).ШиринаКолонки = 8;
	КонецЦикла;
	
	Граница = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	ОбластьТаблицы = Результат.Область(1, 1, НомерСтроки, МаксимальнаяКолонка);
	ОбластьТаблицы.ГраницаСлева = Граница;
	ОбластьТаблицы.ГраницаСверху = Граница;
	ОбластьТаблицы.ГраницаСправа = Граница;
	ОбластьТаблицы.ГраницаСнизу = Граница;
	
КонецПроцедуры

&НаСервере
Функция СписокМесяцевСДанными(Таблица, НачалоПериода, КонецПериода)
	
	МесяцыСДанными = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		МесяцыСДанными.Вставить(СтрокаТаблицы.Период, Истина);
	КонецЦикла;
	
	Месяцы = Новый Массив;
	ПоследнийМесяц = НачалоМесяца(КонецПериода);
	Месяц = НачалоМесяца(НачалоПериода);
	Пока Месяц <= ПоследнийМесяц Цикл
		Если МесяцыСДанными[Месяц] <> Неопределено Тогда
			Месяцы.Добавить(Месяц);
		КонецЕсли;
		Месяц = ДобавитьМесяц(Месяц, 1);
	КонецЦикла;
	
	Возврат Месяцы;
	
КонецФункции

&НаСервере
Процедура ВывестиСообщение(Текст)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицу(НачалоПериода, КонецПериода, СписокАрендаторов)
	
	ОтборПоПлану = "";
	ОтборПоФакту = "";
	Если СписокАрендаторов.Количество() > 0 Тогда
		ОтборПоПлану = "И ГрафикПлатежей.Ссылка.Владелец В (&СписокАрендаторов)";
		ОтборПоФакту = "И ПлатежиПоДоговорам.Договор.Владелец В (&СписокАрендаторов)";
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Т.Договор.Владелец КАК Арендатор,
		|	Т.Договор КАК Договор,
		|	Т.Период КАК Период,
		|	СУММА(Т.План) КАК План,
		|	СУММА(Т.Факт) КАК Факт
		|ИЗ
		|	(ВЫБРАТЬ
		|		ГрафикПлатежей.Ссылка КАК Договор,
		|		НАЧАЛОПЕРИОДА(ГрафикПлатежей.Период, МЕСЯЦ) КАК Период,
		|		СУММА(ГрафикПлатежей.Сумма) КАК План,
		|		0 КАК Факт
		|	ИЗ
		|		Справочник.ДоговорыАрендаторов.ГрафикПлатежей КАК ГрафикПлатежей
		|	ГДЕ
		|		ГрафикПлатежей.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		{{ОтборПоПлану}}
		|	СГРУППИРОВАТЬ ПО
		|		ГрафикПлатежей.Ссылка,
		|		НАЧАЛОПЕРИОДА(ГрафикПлатежей.Период, МЕСЯЦ)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ПлатежиПоДоговорам.Договор,
		|		ПлатежиПоДоговорам.МесяцОплаты,
		|		0,
		|		СУММА(ПлатежиПоДоговорам.Сумма)
		|	ИЗ
		|		РегистрНакопления.ПлатежиПоДоговорам КАК ПлатежиПоДоговорам
		|	ГДЕ
		|		ПлатежиПоДоговорам.МесяцОплаты МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		{{ОтборПоФакту}}
		|	СГРУППИРОВАТЬ ПО
		|		ПлатежиПоДоговорам.Договор,
		|		ПлатежиПоДоговорам.МесяцОплаты) КАК Т
		|СГРУППИРОВАТЬ ПО
		|	Т.Договор.Владелец,
		|	Т.Договор,
		|	Т.Период
		|УПОРЯДОЧИТЬ ПО
		|	Арендатор,
		|	Договор,
		|	Период";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "{{ОтборПоПлану}}", ОтборПоПлану);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "{{ОтборПоФакту}}", ОтборПоФакту);
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецПериода);
	Запрос.УстановитьПараметр("СписокАрендаторов", СписокАрендаторов.ВыгрузитьЗначения());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция СформироватьДолгиНаНачалоПериода(НачалоПериода, СписокАрендаторов)
	
	ОтборПоПлану = "";
	ОтборПоФакту = "";
	Если СписокАрендаторов.Количество() > 0 Тогда
		ОтборПоПлану = "И ГрафикПлатежей.Ссылка.Владелец В (&СписокАрендаторов)";
		ОтборПоФакту = "И ПлатежиПоДоговорам.Договор.Владелец В (&СписокАрендаторов)";
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Т.Договор КАК Договор,
		|	СУММА(Т.План) - СУММА(Т.Факт) КАК Долг
		|ИЗ
		|	(ВЫБРАТЬ
		|		ГрафикПлатежей.Ссылка КАК Договор,
		|		СУММА(ГрафикПлатежей.Сумма) КАК План,
		|		0 КАК Факт
		|	ИЗ
		|		Справочник.ДоговорыАрендаторов.ГрафикПлатежей КАК ГрафикПлатежей
		|	ГДЕ
		|		ГрафикПлатежей.Период < &ДатаНачала
		|		{{ОтборПоПлану}}
		|	СГРУППИРОВАТЬ ПО
		|		ГрафикПлатежей.Ссылка
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ПлатежиПоДоговорам.Договор,
		|		0,
		|		СУММА(ПлатежиПоДоговорам.Сумма)
		|	ИЗ
		|		РегистрНакопления.ПлатежиПоДоговорам КАК ПлатежиПоДоговорам
		|	ГДЕ
		|		ПлатежиПоДоговорам.МесяцОплаты < &ДатаНачала
		|		{{ОтборПоФакту}}
		|	СГРУППИРОВАТЬ ПО
		|		ПлатежиПоДоговорам.Договор) КАК Т
		|СГРУППИРОВАТЬ ПО
		|	Т.Договор";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "{{ОтборПоПлану}}", ОтборПоПлану);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "{{ОтборПоФакту}}", ОтборПоФакту);
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("СписокАрендаторов", СписокАрендаторов.ВыгрузитьЗначения());
	
	Долги = Новый Соответствие;
	Для Каждого Строка Из Запрос.Выполнить().Выгрузить() Цикл
		Долги.Вставить(Строка.Договор, Строка.Долг);
	КонецЦикла;
	
	Возврат Долги;
	
КонецФункции

#КонецОбласти
